[
    {
        "id": 6154,
        "created": "2020-08-21 11:12:11",
        "last_updated": "2020-10-09 21:05:02",
        "time_posted": null,
        "title": "Full Stack Developer (Java)",
        "description": "KEY RESPONSIBILITIES IDEAL EXPERIENCE    1. The ideal candidate for this position will have a minimum of 4+ years.    2. Ability to work independently and to adapt to a fast-changing environment.       3.Creative, self-disciplined, and capable of identifying and completing critical tasks independently and with a sense of urgency.   CRITICAL CAPABILITIES ·        The candidate should be strong in core java (with all current updates) ·        Very strong in Data Structure & Data Structure. ·        Strong web technologies experience (frameworks Spring, Hibernate) ·        Distributed technologies (EJB 3, spring) ·        Hands-on experience in Angular 2 ·        Working on SCRUM ·        Awareness of Middleware technologies (JBoss or any other app server) ·        Strong RDBMS/SQL concepts. ·        Knowledge of JEE6 Specification will be an add on ·        Should have some background in reviewing codes. ·        Unit Testing & Bug Fixing",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Gurgaon, Haryana, India",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-java-at-peoplestrong-1989595717",
        "hash": "5082069f67609450f89805ca545c874b",
        "company_id": 23541684,
        "company_name": "PeopleStrong",
        "company_url": "https://www.linkedin.com/company/peoplestrong",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "Over 200 applicants",
        "linkedin_job_id": 1989595717,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/full-stack-developer-java-at-peoplestrong-1989595717",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Computer Software"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            }
        ],
        "job_functions_collection": [
            "Information Technology",
            "Design"
        ]
    },
    {
        "id": 15157,
        "created": "2020-08-21 12:24:49",
        "last_updated": "2020-09-08 05:56:02",
        "time_posted": null,
        "title": "Data Scientist - Advanced Analytics",
        "description": "Job Description 70 tactical buyers are supporting both commercial and NTO towers out of Prague NGSC, covering region Europe, Switzerland, Middle East and North America. Your responsibilities include, but are not limited to:  Manage the creation, deployment and on -going maintenance of metrics and benchmark to monitor the performance of the global process and its enabling system(s).  Responsible for the management of the end-to-end procurement process by enabling globally defined solutions and driving the local adoption in order to achieve Sourcing excellence.  Support the process super user community, ensuring regular engagement, training (including process & tool demo) and collection of feedback.  Provide guidance and support to the regions and countries and identify areas requiring process and systems reviews.  Coordinate and support process reviews in the regions and countries and provide direction to develop and implement action plans to address identified gaps. -Support the execution of the region or countries performance improvement plans.  Champion specific projects and change management activities to fully establish and continuously improve the process.  Facilitate the discussion with key stakeholders, within procurement and with other functions, to identify opportunities and to drive full process adoption. Minimum Requirements  M.S/Ph.d in Computer Science, Robotics, Mathematics, Statistics, Operations Research, Cognitive Sciences, Psychology, Engineering, Finance, Economics, Medicine, Technology, Management Science, Quantitative Methods and other related disciplines.  6 -10 years of overall experience with demonstrated track record in data science solutioning.  Advanced in-depth specialization in mathematical analysis methods, machine learning, Experience in statistical learning: Supervised and Unsupervised Learning, Classification, Regression, Clustering, Neural Networks, Ensemble Modelling (random forest, boosted tree, etc.), Multivariate Statistics, Non-parametric Methods, Reliability Models, Markov Models, Stochastic models, Bayesian Models is required for this role.  Proven track record in delivering analytics solutions using Time Series Forecasting, Keras, Tensorflow, CNN, GAN, and RNN techniques & Comfortable in using Python or R to build automated dashboards using, D3.js, Plotly, Dash, Flask, Django, R-Shiny & Excellent problem-solving skills, critical thinking and conceptual thinking abilities.  Experience working with big data - identifying trends, patterns, and outliers in large volumes of data & Programming environments: java/python/Hive/Hadoop/HBase/C++/CSharp/Unix/Map Reduce/Perl/ Matlab/Xml. Why consider Novartis? 799 million. That’s how many lives our products touched in 2019. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives? We believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you’re given opportunities to explore the power of digital and data. Where you’re empowered to risk failure by taking smart risks, and where you’re surrounded by people who share your determination to tackle the world’s toughest medical challenges. Imagine what you could do at Novartis! Commitment to Diversity & Inclusion: Novartis embraces diversity, equal opportunity and inclusion. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration, and empowers our people to unleash their full potential. Join our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to learn more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network Division NBS Business Unit PROCUREMENT NBS Country India Work Location Hyderabad, AP Company/Legal Entity Nov Hltcr Shared Services Ind Functional Area Procurement Job Type Full Time Employment Type Regular Shift Work No",
        "seniority": "Associate",
        "employment_type": "Full-time",
        "location": "Hyderabad, Telangana, India",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-advanced-analytics-at-novartis-india-1989718076",
        "hash": "9ee87b2c0aa6f382045f0cc7dad28349",
        "company_id": 24093506,
        "company_name": "Novartis India",
        "company_url": "https://www.linkedin.com/company/novartis-india",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "30 applicants",
        "linkedin_job_id": 1989718076,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/data-scientist-advanced-analytics-at-novartis-india-1989718076",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Pharmaceuticals"
                }
            }
        ],
        "job_functions_collection": [
            "Other",
            "Supply Chain",
            "Purchasing"
        ]
    },
    {
        "id": 28401,
        "created": "2020-08-21 14:19:32",
        "last_updated": "2020-09-08 05:54:25",
        "time_posted": null,
        "title": "Data scientist",
        "description": "Job Description At TomTom… You’ll move the world forward. Every day, we create the most innovative mapping and location technologies to shape tomorrow’s mobility for the better. We are proud to be one team of more than 5,000 unique, curious, passionate problem-solvers spread across the world. We bring out the best in each other. And together, we help the automotive industry, businesses, developers, drivers, citizens and cities move towards a safe, autonomous world that is free of congestion and emissions. TomTom is hiring an experienced data scientist in our maps engineering team. As a Senior Data Scientist, you are passionate about computer visions, statistical sampling and analytic methods, deploying machine learning models @ scale in the production, monitoring and tuning them via active feedback loops. You will be part of agile unit and will be collaborating with engineers, data engineers, map and location experts and fellow data scientists. As an experienced data scientist, you will help to make location content best-in-class by advocating for and implementing changes to technology, process, tools, and systems. We look for people who are curious, innovative, out of box thinker, loves taking risk and work to make system better every day. In this role, the person is expected to take on critical tasks such as productionizing, deploying, testing and monitoring of machine learning models including exposing them as service. What You’ll Do Draw insights by manipulating various types of text data  Applying various data science methods coupled, explore and experiment on new models through research papers or via various frameworks  Develop processes and tools to monitor and analyze model performance and data accuracy  Automate feedback loops for algorithms in production through standardization of process and authoring best practices  Collaborate with teams to bring synergy  Mentor/Coach/Guide team members aspire to become a Data Scientist  What You’ll Need Bachelor’s/Masters in Computer science, Mathematics, Statistics or equivalent field and must have min. 5+ years of overall experience  Minimum 2-3 Years of experience working as a Data Scientist in AI/ML projects  Experience in slicing and dicing of large data sets to draw insights  Experience in various machine learning techniques (e.g. NLP, Decision tree, Regression, etc..) and frameworks (e.g. TensorFlow, PyTorch, Scikit-learn, etc.)  Familiarity with cloud platforms (AWS/Azure) using Dockers/Kubernetes  Experience working with data technologies that allow effective storage and analysis of large amounts of data (e.g. Hadoop, Hive, Spark, Presto, S3, etc).  Proficiency in Python, Unix/Linux and SQL  Active participation in competitions on a platform such as Kaggle  Strong problem-solving skills  A drive to learn new technologies  Expertise in designing and testing experiments  Knowledge and experience with using GIS tools for spatial data analysis.  Excellent written, verbal and presentation skills  Meet your team MAPS Product Unit Part of TomTom’s Location Technology Products technical unit, the Maps product unit is comprised of over 2,000 people in 40 countries – all driven to deliver the most up-to-date, accurate and detailed maps for the hundreds of millions of people using TomTom maps around the world. Joining this product unit, you can help continuously innovate our map-making processes, create a real-time closed loop between detected changes in the real world and the users’ map, and build maps that will enable the future of autonomous driving. Achieve more!!! We are self-starters who play well with others. Every day, we solve new problems with creativity, meet new people and learn rapidly at our offices around the world. We will invest in your growth and are committed to supporting you. In everything we do, we’re guided by six values We care, putting our heart into what we do; we build trust (you can count on us); we create – it’s how we make a difference; we are confident, but don’t boast; we keep it simple because life is complex enough; and we have fun because life’s too short to be boring.  Ready to move the world forward? After you apply Our recruitment team will work hard to give you a meaningful experience throughout the process, no matter the outcome. Your application will be screened  closely, and you can rest assured that all follow-up actions will be thorough, from assessments, conversations and interviews through your onboarding. TomTom is an equal opportunity employer We celebrate diversity, thrive on each other’s differences and are committed to creating an inclusive environment at our offices around the world. Naturally, we do not discriminate against any employee or job applicant because of race, religion, color, sexual orientation, gender, gender identity or expression, marital status, disability, national origin, genetics, or age. TomTom India Private Limited is one of India’s Best IT & IT- BPM Company to Work for - 2018. It is amongst 50 Best IT & IT-BPM companies to work for in India and amongst the Top 5 among Emerging organizations in IT & IT-BPM. For the full story about the vacancy or procedure, please click on  www.tomtom.com/careers   or contact Swathi Kesireddy. Online assessments and pre-employment screening are part of the selection process.",
        "seniority": "Not Applicable",
        "employment_type": "Full-time",
        "location": "Pune, Maharashtra, India",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-at-tomtom-2002559297",
        "hash": "e952b57b3c963e70a42566123c4a2997",
        "company_id": 2436043,
        "company_name": "TomTom",
        "company_url": "https://www.linkedin.com/company/tomtom",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "101 applicants",
        "linkedin_job_id": 2002559297,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/data-scientist-at-tomtom-2002559297",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Automotive"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Consumer Electronics"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 29622,
        "created": "2020-08-21 14:40:02",
        "last_updated": "2020-09-08 05:54:16",
        "time_posted": null,
        "title": "Application Developer: Java Full Stack",
        "description": "Introduction As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact! Your Role and Responsibilities  Your day in the role will include...   Expert in Backend and Front end technologies   Proven in developing and implementation and providing solutions to the given problem in all the Java technologies   Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database   Strong into trends and directions of the Industry, marketplace and the players   Provide objective guidance without personal or political considerations   You will come with...   Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.   Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.   Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit   How we’ll help you grow:   You’ll have access to all the technical and management training courses that will help you   You’ll learn directly from guide developers in the field; our team leads love to mentor   You have the opportunity to work in many different areas to identify what really excites you  Required Technical and Professional Expertise  Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns  Preferred Technical And Professional Expertise  Microservices , Docker, Spring Cloud, GW About Business Unit IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence. Your Life @ IBM What matters to you when you’re looking for your next career challenge? Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement For additional information about location requirements, please discuss with the recruiter following submission of your application. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Bengaluru, Karnataka, India",
        "url": "https://www.linkedin.com/jobs/view/application-developer-java-full-stack-at-ibm-2002653881",
        "hash": "90c194a8e9a27cb7bb733cf71f7cd59d",
        "company_id": 3652437,
        "company_name": "IBM",
        "company_url": "https://www.linkedin.com/company/ibm",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "70 applicants",
        "linkedin_job_id": 2002653881,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/application-developer-java-full-stack-at-ibm-2002653881",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Financial Services"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Computer Software"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 29641,
        "created": "2020-08-21 14:40:03",
        "last_updated": "2020-09-08 05:54:16",
        "time_posted": null,
        "title": "Application Developer: Java Full Stack",
        "description": "Introduction As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact! Your Role and Responsibilities  You and IBM India   IBM's Purpose is to be essential to our clients, to the world and one another and we are confident that together as IBMers we will drive this purpose. Joining IBM is about joining a culture of openness, teamwork, trust, and the invitation and expectation to have a voice. Join us and Do your Best Work Ever. IBM is recognized gold standard for inclusion, reflected in winning, to name few, the 2018 Catalyst Award for advancing women in business, the National Award Best Employer of People with Disabilities and being named one of the top 5 2018 Top Companies for Women Technologists for building an inclusive workplace — We advocate for fairness and equality as everyone is, and always has been, welcome at IBM. We at IBM Global Business Services (GBS) are a dynamic group of Business, Strategy and Technology professionals - a specific source of market-leading Industry Consulting, Application and Business process management, supported by the industry's most sophisticated outcome-based delivery model. All designed to be the Digital Reinvention partner for leading clients across the world - providing value-led and asset-powered end to end solutions. With a global footprint in over 170 countries, we are empowering clients to build upon their tremendous heritage in Application Innovation processes and also transform them to a Cloud, Cognitive and Social centric world. With skills across six sectors and 17 industries, all major service lines and competencies, IBM’s GBS is a promising business unit in itself to be a part of. Through our unique global delivery network; IBM offers global expertise coupled with a deep understanding of local capabilities, markets and cultures you could be part of and partner on some great projects with some of the best corporations in the world across geographies. Our IBM and Salesforce strategic partnerships strengthens and delivers new solutions to enterprise customers using IBM Cloud and Watson services with Salesforce Quip and Salesforce Service Cloud Einstein. Together we deliver solutions that bring together the power of AI and enable companies to make smarter decisions, faster than ever before.  Your day in the role will include...   Expert in Backend and Front end technologies   Proven in developing and implementation and providing solutions to the given problem in all the Java technologies   Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database   Strong into trends and directions of the Industry, marketplace and the players   Provide objective guidance without personal or political considerations   You will come with...   Hands on experience with JAVA 8 and above – Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above.   Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven.   Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit   How we’ll help you grow:   You’ll have access to all the technical and management training courses that will help you   You’ll learn directly from guide developers in the field; our team leads love to mentor   You have the opportunity to work in many different areas to identify what really excites you  Required Technical and Professional Expertise  Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns  Preferred Technical And Professional Expertise  Microservices , Docker, Spring Cloud, GW About Business Unit IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence. Your Life @ IBM What matters to you when you’re looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement For additional information about location requirements, please discuss with the recruiter following submission of your application. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Mumbai, Maharashtra, India",
        "url": "https://www.linkedin.com/jobs/view/application-developer-java-full-stack-at-ibm-2002658521",
        "hash": "33d48aa782172778c50eafd8334eab1c",
        "company_id": 3652437,
        "company_name": "IBM",
        "company_url": "https://www.linkedin.com/company/ibm",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "30 applicants",
        "linkedin_job_id": 2002658521,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/application-developer-java-full-stack-at-ibm-2002658521",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Financial Services"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Computer Software"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 37071,
        "created": "2020-08-21 16:32:15",
        "last_updated": "2020-09-08 05:53:03",
        "time_posted": null,
        "title": "Full-Stack Developer, ENO-AVP #157143",
        "description": "We Offer Project Description Digital Credit Risk Team within Platform IT is new initiative in the bank. Credit risk most simply defined as the potential that a bank borrower or counterparty will fail to meet its obligations in accordance with agreed terms. The goal of credit risk management is to maximize a bank’s risk-adjusted rate of return by maintaining credit risk exposure within acceptable parameters. Banks need to manage the credit risk inherent in the entire portfolio as well as the risk in individual credits or transactions. Banks should also consider the relationships between credit risk and other risks. The effective management of credit risk is a critical component of a comprehensive approach to risk management and essential to the long-term success of any banking organization. We are a department which values Diversity and Inclusion (D&I) and is committed to realizing the firm’s D&I ambition which is an integral part of our global Conduct and Ethics Standards Brand-new product development initiatives and within the Digital Transformation team which grows with Innovation and delivering high quality products to its clients. Play a pivotal role in Design Thinking, Lean, Agile journey combining the art of programming with design.  Work in a culture which thrives on Innovation You Offer Understand the value of diversity in the workplace and is dedicated to fostering an inclusive culture in all aspects of working life so that people from all backgrounds receive equal treatment, realize their full potential and can bring their full, authentic selves to work. This should be further elaborated on in your application.  Outstanding acumen and understanding of Data Structures, Algorithms and Computer Science fundamentals. Result oriented, dedicated, hardworking and can work on own initiative whilst also working collaboratively and deliver on time with a high level of integrity, sense of urgency, attention to detail and quality standards 5-7 Years’ Experience With The Following Backend Technologies Strong OOPS, Design Patterns, Core Java fundamentals; Java 11, GraphQL, Spring Boot, Spring Cloud, JPA Well versed with Unit and Regression (e2e) Testing frameworks. 3-5 Years’ Experience With The Following UI Technologies Strong fundamentals on HTML, CSS3, Vanilla Javascript. React JS Ecosystem, Webpack. Proficient in Unit and Regression (e2e) Testing Frameworks. Worked on project involving Relational Database and is able to optimize queries with knowledge of indexes, clusters etc.  Contribution to Open Source projects plays an equally important role. Knowledge of Reactive Programming paradigm and it’s ecosystem is a plus Proficient in DevOps processes i.e. CI/CD Pipelines, Configuration management tools such as Salt Stack, Ansible etc.  Knowledge of open source container application platform based on the Kubernetes container orchestrator for enterprise app development. India-Pune-Pune",
        "seniority": "Entry level",
        "employment_type": "Full-time",
        "location": "Pune, Maharashtra, India",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-eno-avp-%23157143-at-credit-suisse-1989757845",
        "hash": "6aa9b895bb34b37ac3976c5a623357fc",
        "company_id": 1765880,
        "company_name": "Credit Suisse",
        "company_url": "https://www.linkedin.com/company/credit-suisse",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "Be among the first 25 applicants",
        "linkedin_job_id": 1989757845,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/full-stack-developer-eno-avp-%23157143-at-credit-suisse-1989757845",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Banking"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Investment Banking"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 41540,
        "created": "2020-08-21 17:57:51",
        "last_updated": "2020-09-08 05:52:21",
        "time_posted": null,
        "title": "Data Scientist (Artificial Intelligence)",
        "description": "ElectrifAi is a global leader in building innovative artificial intelligence-based products and is on a mission to help organizations change the way they work through machine learning: driving profit, performance improvement and risk reduction. Founded in 2004, the company draws on 16 years of industry leadership, a global team of domain experts, and a proven record of transforming structured and unstructured data at scale. The company’s Ai and ML based products and models reach across business functions, data systems, and teams to drive superior results in record time. ElectrifAi has over 100+ data scientists, 50+ software engineers and a proven record of dealing with over 2,000 customer implementations. ElectrifAi is headquartered in Jersey City, with offices located in Shanghai and New Delhi. ElectrifAi is looking to hire experienced Data Scientists to deliver machine learning solutions and models to global customers around the world.  Responsibilities: You will develop and deploy state-of-the-art, data-driven predictive models to solve business problems using state-of-the-art technologies in machine learning, statistical modeling and operations research. You will have the opportunity to solve multiple client problems and deliver value in the market place through consulting engagements, new product development and/or through research initiatives. As a data scientist you should be able to experiment with alternative approaches and algorithms to solve complex business problems. Understand the technology and explain to internal audiences and assist in communication with external audiences. Work will require effective cooperation with other team members globally including data science teams, software, business, and sometimes with clients.   Qualifications  We’re looking for someone with at least 7 years of experience manipulating data sets and building statistical models. The ideal candidate should possess at least a Bachelor's or its equivalent in Math, Statistics, Engineering, Machine Learning, Physics, Econometrics or a related quantitative field and is familiar with the following software/tools: Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc. Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc. Experience querying databases and using statistical computer languages: R, Python, SLQ, etc. Experience using web services: Spark, Redshift, S3 etc. Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc. Experience analyzing data from various 3rd party providers across industry verticals Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc. The ideal candidate will have demonstrable experience applying data science methods to real-world machine learning problems.",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Uttar Pradesh, India",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-artificial-intelligence-at-electrifai-1989782860",
        "hash": "757ef640fa3f19088d33fdcae98320a0",
        "company_id": 22863673,
        "company_name": "ElectrifAi",
        "company_url": "https://www.linkedin.com/company/electrifai",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "161 applicants",
        "linkedin_job_id": 1989782860,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/data-scientist-artificial-intelligence-at-electrifai-1989782860",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            }
        ],
        "job_functions_collection": [
            "Information Technology"
        ]
    },
    {
        "id": 41716,
        "created": "2020-08-21 17:58:07",
        "last_updated": "2020-10-26 18:24:20",
        "time_posted": null,
        "title": "Data Scientist",
        "description": "Job Description General Position Definition  This role will drive analytics and data science for one or more of Shell’s Retail business teams   The ideal candidate is passionate about delivering commercial value and insights through Retail Analytics and Data Science   We help the business team’s answer some of the following questions:  What is the right assortment and mix of products to drive category growth?   How responsive are our products to price changes?   Which of our competitors impact our sales and pricing?   How can we improve the customer experience at our outlets?   Which customers are most likely to churn?   Candidate should be able to ask the right questions, ability to move from data to insight to action, break down strategic & operational questions from different Retail teams and structurally answer them with data driven insights   Incumbent is responsible for working on a range of technologies and tools collaborating directly with the Retail stakeholders & other partners  Requirements Skills Industry / Functional Expertise  Provide deep business expertise in Retail/CPG businesses:  Category Analytics:   Range reviews, Assortment planning, identifying trends and patterns in category performance, new product launches   Pricing Analytics:   Understanding Price elasticity, evaluating impact of competitor pricing, impact of pricing changes on margins   Marketing and Promotion Analytics   : Campaign design and promo effectiveness testing, churn prediction, cross-sell / up-sell, Market Basket Analysis, Customer segmentation, propensity analysis, customer lifetime value, market mix modeling   Store Analytics:   Leverage data and visualization to create actionable insights for on ground store teams, territory and district managers   Should have strong story telling skills: Ability to explain complex data and models to business teams   Proficiency Level:  Mastery   Stakeholder Engagement Skills  Working collaboratively across multiple sets of stakeholders – business SMEs, IT, Data teams, Analytics resources to deliver on project deliverables and tasks   Identify actionable insights that directly address Retail Team’s challenges / opportunities   Articulate business insights and recommendations to respective stakeholders   Understanding business KPI's, frameworks and drivers for performance   Proficiency Level:  Mastery   Technology Skills  Strong experience in specialized analytics tools and technologies (including, but not limited to)  Azure Databricks, Alteryx   Power BI, Spotfire or other visualization tools   Python, R   Statistics / Machine Learning   : Data Quality Analysis, Exploratory data analysis, Hypothesis testing, Univariate / Multivariate Analysis, Classification/PCA, Factor Analysis, Linear Modeling, Affinity & Association, Time Series, Decision Trees, sentiment analysis, Clustering   Identify the right approach(es) for given scenario and articulate why the approach fits   Assess data availability and modeling feasibility   Proficiency Level:  Skill-to-Mastery   Special Challenges  Easily analyzes, draws and synthesizes important insights from complex data.   Extremely curious and self-driven to understand business performance through data.   Ability to translate a business question into a well-defined analytical plan that includes data requirements for technical resources to extract the necessary data.   Rapid onboarding on projects, understanding analytics goal and working with ill-defined datasets   Communicating technical jargon in plain English to colleagues within Data Science team and outside   Virtual working with network of colleagues located throughout the globe  Company Description The aim of Shell Business Operations Chennai is to provide the Group with operational excellence through highlighting and utilizing process improvements and functional efficiencies as well as by leveraging economies of scale. Currently, the Chennai centre provides a wide range of finance, accounting and business services to Shell operating companies across several business sectors globally. Set up in September 2007, the Chennai centre has grown rapidly and now , in its fourth year of operations , it has crossed the 1600 staff mark. The centre is located in the RMZ Millennia Business Park, where the Shell campus is a LEED Platinum building with world class infrastructure. The business is expected to grow further over the next two years and infrastructural additions to support this have been planned. The main focus in Chennai is on Finance Operations which supports delivery of the global Finance functional plan. There is also a ‘Downstream India’ - Customer Services Team that handles lubricant depot ordering within the country. The Shell Business Operations (SBO Team) manages the centre facilities and supports business partners’ operations on site. There is a strong focus at SBO on safety & well being of staff and on its three core values: Compliance, Intervention & Respect. Disclaimer Please note: We occasionally amend or withdraw Shell jobs and reserve the right to do so at any time, including prior to the advertised closing date. Before applying, you are advised to read our data protection policy. This policy describes the processing that may be associated with your personal data and informs you that your personal data may be transferred to Royal Dutch/Shell Group companies around the world. The Shell Group and its approved recruitment consultants will never ask you for a fee to process or consider your application for a career with Shell. Anyone who demands such a fee is not an authorised Shell representative and you are strongly advised to refuse any such demand. Shell is an Equal Opportunity Employer. Work Location Chennai - RMZ Millenia SBO Location Chennai No. of Positions 25",
        "seniority": "Not Applicable",
        "employment_type": "Full-time",
        "location": "Chennai, Tamil Nadu, India",
        "url": "https://www.linkedin.com/jobs/view/data-scientist-at-shell-1989788385",
        "hash": "a2929fd2378fc81fd06afb5c13789a1b",
        "company_id": 9724492,
        "company_name": "Shell",
        "company_url": "https://www.linkedin.com/company/shell",
        "external_url": "https://ad.doubleclick.net/ddm/trackclk/N8084.158707LINKEDIN0/B22177023.244243994;dc_trk_aid=441203536;dc_trk_cid=111001261;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=?https://ad.doubleclick.net/ddm/trackclk/N8084.158707LINKEDIN0/B22177023.244243883;dc_trk_aid=441185909;dc_trk_cid=111001261;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=?https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&partnerid=30030&siteid=5876&jobId=1704928",
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "Over 200 applicants",
        "linkedin_job_id": 1989788385,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/data-scientist-at-shell-1989788385",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Oil & Energy"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 46177,
        "created": "2020-08-21 18:45:27",
        "last_updated": "2020-09-08 05:51:30",
        "time_posted": null,
        "title": "Full Stack Developer",
        "description": "Urgently Hiring Full Stack Developer for our client at Hyderabad Location.  POSITION – FULL STACK DEVELOPER Education: BE / BTech  Location: Initially wherever you have a reliable & secure internet line. Post-COVID emergency: Hyderabad  Salary Range: 8LPA to 12LPA  Responsibilities: 2 years of minimum experience with web development Knowledge or experience with JavaScript,  Angular and/or ReactJS,  HTML5, JQuery, AJAX, and CSS Knowledge or experience with Bootstrap and/or Material Design Knowledge or experience with  SQL or NoSQL databases  (T-SQL, PL/SQL, and HIVE) Knowledge or experience with ETL Tools, such as Nifi, SSIS.etc Knowledge or experience with user interaction and visual design techniques Knowledge or experience in designing and developing mobile compatible web user interfaces Knowledge of Web coding standards, security standards, and multi-browser compatibilities Knowledge or experience developing restful web services using  NodeJS , Apache or C# Knowledge of  AWS or AZURE  communication Knowledge or experience of API's Strong communication & problem-solving skills Experience in Agile methodology Requirements: Strong knowledge of programming language  C# / Python Strong knowledge of Front End Technologies  Angular JS / React JS Strong knowledge of Back end Technologies  Node JS  / .NET Knowledge of any of  Cloud Technologies",
        "seniority": "Entry level",
        "employment_type": "Full-time",
        "location": "Hyderabad, Telangana, India",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-at-recruitment-consultant-2002848195",
        "hash": "c069183c66e372ebebb3470b083457c8",
        "company_id": 11848198,
        "company_name": "Recruitment Consultant",
        "company_url": "https://www.linkedin.com/company/recruitment-consultant",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "56 applicants",
        "linkedin_job_id": 2002848195,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/full-stack-developer-at-recruitment-consultant-2002848195",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Computer Software"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Information Technology and Services"
                }
            }
        ],
        "job_functions_collection": [
            "Engineering",
            "Information Technology"
        ]
    },
    {
        "id": 56401,
        "created": "2020-08-21 21:11:30",
        "last_updated": "2020-09-02 07:55:37",
        "time_posted": null,
        "title": "Senior Data Scientist",
        "description": "Description Our Company We help people around the world save money and live better -- anytime and anywhere -- in retail stores, online and through their mobile devices. Each week, more than 220 million customers and members visit our 11,096 stores under 69 banners in 27 countries and e-commerce websites in 10 countries. With last fiscal revenues of approximately $486 billion, Walmart employs 2.2 million employees worldwide. @ Walmart Labs in Bangalore, we use technology for the charter of building brand new platforms and services on the latest technology stack to support both our stores and e-commerce businesses worldwide. @ Our team: We work on Transportation Optimization NP hard problems to come up with optimal solution. We perform Network optimization problems. Expertise on operations research, stochastic optimization, machine learning, queuing theory, probability theory to construct models for solving network optimization problems. Good knowledge on ML models, Expertise in Python LP Modeling for Linear & Non Linear modelling using CPLEX, GUROBI Skills Required Operational research, Mathematical modeling of NP hard problems using CPLEX, GUROBI, univariate and multivariate regression models Location Bengaluru, Karnataka, India Education/Qualification Any Graduate/PG Desirable Skills Java, Python Designation Senior Data Scientist",
        "seniority": "Associate",
        "employment_type": "Full-time",
        "location": "Bengaluru, Karnataka, India",
        "url": "https://www.linkedin.com/jobs/view/senior-data-scientist-at-walmart-global-tech-india-1983088034",
        "hash": "da75c09b0fa55eeca54202948d4c7c80",
        "company_id": 29863672,
        "company_name": "Walmart Global Tech India",
        "company_url": "https://www.linkedin.com/company/walmartglobaltechindia",
        "external_url": null,
        "deleted": 1,
        "application_active": 0,
        "salary": null,
        "applicants_count": "63 applicants",
        "linkedin_job_id": 1983088034,
        "country": "India",
        "redirected_url": "https://www.linkedin.com/jobs/view/senior-data-scientist-at-walmart-global-tech-india-1983088034",
        "job_industry_collection": [
            {
                "job_industry_list": {
                    "industry": "Computer Software"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Computer & Network Security"
                }
            },
            {
                "job_industry_list": {
                    "industry": "Retail"
                }
            }
        ],
        "job_functions_collection": [
            "Other"
        ]
    }
]